<?php

namespace Database\Seeders;

use App\Models\Post;
use Illuminate\Database\Seeder;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        ///  المطاهم
        $post1 = Post::create([
            'title' => 'المطعم الرئيسي',
            'summary' => 'في الطابق الثالث',
            'description' => 'نرحب بكم في مطعمنا ، حيث نسعى جاهدين لخلق تجربة طعام لا مثيل لها ترضي الحواس وتغذي الروح. فريقنا من خبراء الطهي مكرس للحصول على المكونات الطازجة والأعلى جودة فقط ، وإعداد كل طبق بعناية واهتمام بالتفاصيل. شكرا لاختيارك مطعمنا من أجل الاستمتاع بتناول الطعام. يشرفنا أن تكون ضيفًا لنا ونتطلع إلى خدمتك مرة أخرى قريبًا.',
            'language_id' => 1,
            'category_id' => 10,
        ]);
        $post2 = Post::create([
            'title' => 'مطعم قصب',
            'summary' => 'في الهواء الطلق',
            'description' => 'يسعدنا أن نرحب بك في صالة الألعاب الرياضية الخاصة بنا ، حيث ستجد أحدث المعدات والمدربين الخبراء ومجموعة متنوعة من دروس اللياقة البدنية لمساعدتك على البقاء نشطًا وصحيًا. سواء كنت رياضيًا متمرسًا أو جديدًا في مجال اللياقة ، نحن هنا لمساعدتك على النجاح.  ',
            'language_id' => 1,
            'category_id' => 10,
        ]);
        //النشاطات
        $post3 = Post::create([
            'title' => 'نادي نسمة جبل',
            'summary' => 'في الطابق الرابع',
            'description' => 'نرحب بكم في مطعمنا ، حيث نسعى جاهدين لخلق تجربة طعام لا مثيل لها ترضي الحواس وتغذي الروح. فريقنا من خبراء الطهي مكرس للحصول على المكونات الطازجة والأعلى جودة فقط ، وإعداد كل طبق بعناية واهتمام بالتفاصيل. شكرا لاختيارك مطعمنا من أجل الاستمتاع بتناول الطعام. يشرفنا أن تكون ضيفًا لنا ونتطلع إلى خدمتك مرة أخرى قريبًا.',
            'language_id' => 1,
            'category_id' => 12,
        ]);
        $post4 = Post::create([
            'title' => 'سينما نسمة جبل',
            'summary' => 'في الطابق الخامس',
            'description' => 'السينما لدينا مجهزة بأحدث التقنيات لتزويدك بأفضل تجربة سينمائية ممكنة. من الصور فائقة الوضوح إلى الصوت الغامر ، نفخر بتقديم تجربة أفلام عالية الجودة تنقلك إلى عالم آخر.
نعتقد أن السينما هي أكثر من مجرد ترفيه. إنها وسيلة قوية يمكنها تحدي تصوراتنا ، وإثارة خيالنا ، وتجمعنا معًا.',
            'language_id' => 1,
            'category_id' => 12,
        ]);
        // طبيعتنا
        $post5 = Post::create([
            'title' => 'الجوبة',
            'summary' => 'على بعد 65 كيلومتر',
            'description' => 'يسعدنا أن نرحب بك في صالة الألعاب الرياضية الخاصة بنا ، حيث ستجد أحدث المعدات والمدربين الخبراء ومجموعة متنوعة من دروس اللياقة البدنية لمساعدتك على البقاء نشطًا وصحيًا. سواء كنت رياضيًا متمرسًا أو جديدًا في مجال اللياقة ، نحن هنا لمساعدتك على النجاح.  ',
            'language_id' => 1,
            'category_id' => 13,
        ]);
        $post6 = Post::create([
            'title' =>      'غابة الصنوبر',
            'summary' =>     'على بعد 10 كيلومتر',
            'description' => 'نرحب بكم في مطعمنا ، حيث نسعى جاهدين لخلق تجربة طعام لا مثيل لها ترضي الحواس وتغذي الروح. فريقنا من خبراء الطهي مكرس للحصول على المكونات الطازجة والأعلى جودة فقط ، وإعداد كل طبق بعناية واهتمام بالتفاصيل. شكرا لاختيارك مطعمنا من أجل الاستمتاع بتناول الطعام. يشرفنا أن تكون ضيفًا لنا ونتطلع إلى خدمتك مرة أخرى قريبًا.',
            'language_id' => 1,
            'category_id' => 13,
        ]);
        // المسابح
        $post7 = Post::create([
            'title' => 'المسبح الخارجي',
            'summary' => 'في الهواء الطلق',
            'description' => 'السينما لدينا مجهزة بأحدث التقنيات لتزويدك بأفضل تجربة سينمائية ممكنة. من الصور فائقة الوضوح إلى الصوت الغامر ، نفخر بتقديم تجربة أفلام عالية الجودة تنقلك إلى عالم آخر.
نعتقد أن السينما هي أكثر من مجرد ترفيه. إنها وسيلة قوية يمكنها تحدي تصوراتنا ، وإثارة خيالنا ، وتجمعنا معًا.',
            'language_id' => 1,
            'category_id' => 14,
        ]);
        $post8 = Post::create([
            'title' => 'المسبح الداخلي',
            'summary' => 'في الطابق الأول',
            'description' => 'منطقة المسبح الداخلي لدينا فسيحة وتتميز بكراسي استلقاء مريحة. يتم تسخين المسبح نفسه إلى درجة حرارة مريحة ، مما يجعله مناسبًا للسباحة.
تعتبر المسابح الداخلية طريقة رائعة للحفاظ على لياقتك وصحتك ، حيث أن السباحة تمرين منخفض التأثير يوفر تمرينًا لكامل الجسم.
 بالإضافة إلى ذلك ، توفر حمامات السباحة الداخلية بيئة آمنة وخاضعة للرقابة للأطفال لتعلم السباحة وللكبار لممارسة مهارات السباحة.',
            'language_id' => 1,
            'category_id' => 14,
        ]);
        // المؤتمرات
        $post9 = Post::create([
            'title' => 'جمعية الأمراض المعدية ',
            'summary' => 'تموز 17, 2023',
            'description' => 'جمعية الأمراض المعدية هي منظمة ملتزمة بالوقاية، تشخيص وعلاج الأمراض المعدية. تجمع بين المتخصصين في الرعاية الصحية والباحثين
وخبراء في مجال الأمراض المعدية لتعزيز التفاهم ووضع استراتيجيات فعالة ،إجراء البحوث وتوفير التعليم والتدريب وزيادة الوعي العام.
تلعب جمعية الأمراض المعدية دوراً حيوياً في تطوير مجال الأمراض المعدية وتحسين نتائج الصحة العامة.',
            'language_id' => 1,
            'category_id' => 16,
        ]);
        $post10 = Post::create([
            'title' => 'محاربة السرطان',
            'summary' => 'محاربة السرطان',
            'description' => 'إن سرطان الثدي هو خصم قوي لكنكِ أقوى منه. لديكِ القوة والمرونة والتصميم على محاربة هذا المرض والتغلب عليه. تذكري أنك لستي وحدك في هذه المعركة. لديك فريق من المتخصصين في الرعاية الصحية والأحباء والداعمين الذين يقفون معك في كل خطوة على الطريق، ولا تترددين في طرح أي أسئلة على فريق الرعاية الصحية الخاص بك. معا يمكننا محاربة سرطان الثدي والخروج بشكل أقوى على الجانب الآخر.',
            'language_id' => 1,
            'category_id' => 16,
        ]);
        // الاحداث الرياضية
        $post11 = Post::create([
            'title' => 'محاربة السرطان',
            'summary' => 'محاربة السرطان',
            'description' => 'إن سرطان الثدي هو خصم قوي لكنكِ أقوى منه. لديكِ القوة والمرونة والتصميم على محاربة هذا المرض والتغلب عليه. تذكري أنك لستي وحدك في هذه المعركة. لديك فريق من المتخصصين في الرعاية الصحية والأحباء والداعمين الذين يقفون معك في كل خطوة على الطريق، ولا تترددين في طرح أي أسئلة على فريق الرعاية الصحية الخاص بك. معا يمكننا محاربة سرطان الثدي والخروج بشكل أقوى على الجانب الآخر.',
            'language_id' => 1,
            'category_id' => 16,
        ]);
        Post::factory(10)->create();
    }
}
